/**
 * @Description: 正则匹配的整理归纳
 * @author jing
 * @date: 2020/10/9 15:11
 * @params:
 * 使用方法-例： this.$regular.isPhone
 */

let regular = {
  isPhone: /^1\d{10}$/, // 校验手机号
  isMob: /^((\+?86)|(\(\+86\)))?(13[012356789][0-9]{8}|15[012356789][0-9]{8}|18[02356789][0-9]{8}|147[0-9]{8}|1349[0-9]{7})$/,
  maxNumber_25: /^\d{0,25}$/, // 请输入0-25位数字
  MatchChinese: /^[\u2E80-\u9FFF]+$/, // 只允许输入中文
  MatchEnglish: /^[a-zA-Z]+$/, // 只允许输入英文
  AllNumber: /^\d+$/, // 只允许数字
  hasPriceNum: /^\d*[.]?\d{1,2}$/, // 价格必须为数字,且最多允许两位小数，可以等于0
  NoDecima: /^\d+\.\d+$/, // 不能为小数
  isMailbox: /^[a-zA-Z0-9]+([_.-][a-zA-Z0-9]+)*@([a-zA-Z0-9]+[-_.]?[.])+[a-zA-Z]{2,3}$/, // 校验邮箱
  postalCode: /^[0-9]{6}$/, // 邮政编码
  integer: /^[0-9]+.?[0-9]*$/, // 大于或等于0的整数
  fixedTelephone: /^\d{3,4}-\d{7,8}(-\d{3,4})?$/g, // 固定电话
  integerZero: /^(0|[1-9][0-9]*)$/, // 大于等于0的整数
  positiveNumber: /^\+?[1-9][0-9]*$/, // 大于0的整数
  positiveFloat: /^(?!0+(\.0+)?$)\d+(\.\d{0,2})?$/, // 大于0的浮点数，小数点后不超过两位
  twoFloat: /^[-+]?[0-9]+(\.[0-9]{1,2})?$/, // 大于0的浮点数，小数点后不超过两位
};
export default regular;
